espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/efuse_reg.h
/** EFUSE_RD_REPEAT_DATA2_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA2_REG (DR_REG_EFUSE_BASE + 0x38)
/** EFUSE_KEY_PURPOSE_2 : RO; bitpos: [3:0]; default: 0;
 *  Purpose of Key2.
 */
#define EFUSE_KEY_PURPOSE_2    0x0000000FU
#define EFUSE_KEY_PURPOSE_2_M  (EFUSE_KEY_PURPOSE_2_V << EFUSE_KEY_PURPOSE_2_S)
#define EFUSE_KEY_PURPOSE_2_V  0x0000000FU
#define EFUSE_KEY_PURPOSE_2_S  0
/** EFUSE_KEY_PURPOSE_3 : RO; bitpos: [7:4]; default: 0;
 *  Purpose of Key3.
 */
#define EFUSE_KEY_PURPOSE_3    0x0000000FU
#define EFUSE_KEY_PURPOSE_3_M  (EFUSE_KEY_PURPOSE_3_V << EFUSE_KEY_PURPOSE_3_S)
#define EFUSE_KEY_PURPOSE_3_V  0x0000000FU
#define EFUSE_KEY_PURPOSE_3_S  4
/** EFUSE_KEY_PURPOSE_4 : RO; bitpos: [11:8]; default: 0;
 *  Purpose of Key4.
 */
#define EFUSE_KEY_PURPOSE_4    0x0000000FU
#define EFUSE_KEY_PURPOSE_4_M  (EFUSE_KEY_PURPOSE_4_V << EFUSE_KEY_PURPOSE_4_S)
#define EFUSE_KEY_PURPOSE_4_V  0x0000000FU
#define EFUSE_KEY_PURPOSE_4_S  8
/** EFUSE_KEY_PURPOSE_5 : RO; bitpos: [15:12]; default: 0;
 *  Purpose of Key5.
 */
#define EFUSE_KEY_PURPOSE_5    0x0000000FU
#define EFUSE_KEY_PURPOSE_5_M  (EFUSE_KEY_PURPOSE_5_V << EFUSE_KEY_PURPOSE_5_S)
#define EFUSE_KEY_PURPOSE_5_V  0x0000000FU
#define EFUSE_KEY_PURPOSE_5_S  12
/** EFUSE_SEC_DPA_LEVEL : RO; bitpos: [17:16]; default: 0;
 *  Configures the clock random divide mode to determine the dpa secure level
 */
#define EFUSE_SEC_DPA_LEVEL    0x00000003U
#define EFUSE_SEC_DPA_LEVEL_M  (EFUSE_SEC_DPA_LEVEL_V << EFUSE_SEC_DPA_LEVEL_S)
#define EFUSE_SEC_DPA_LEVEL_V  0x00000003U
#define EFUSE_SEC_DPA_LEVEL_S  16
/** EFUSE_RD_RESERVE_0_114 : RW; bitpos: [18]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_114    (BIT(18))
#define EFUSE_RD_RESERVE_0_114_M  (EFUSE_RD_RESERVE_0_114_V << EFUSE_RD_RESERVE_0_114_S)
#define EFUSE_RD_RESERVE_0_114_V  0x00000001U
#define EFUSE_RD_RESERVE_0_114_S  18
/** EFUSE_XTS_DPA_CLK_ENABLE : RO; bitpos: [19]; default: 0;
 *  Sets this bit to enable xts clock anti-dpa attack function.
 */
#define EFUSE_XTS_DPA_CLK_ENABLE    (BIT(19))
#define EFUSE_XTS_DPA_CLK_ENABLE_M  (EFUSE_XTS_DPA_CLK_ENABLE_V << EFUSE_XTS_DPA_CLK_ENABLE_S)
#define EFUSE_XTS_DPA_CLK_ENABLE_V  0x00000001U
#define EFUSE_XTS_DPA_CLK_ENABLE_S  19
/** EFUSE_SECURE_BOOT_EN : RO; bitpos: [20]; default: 0;
 *  Set this bit to enable secure boot.
 */
#define EFUSE_SECURE_BOOT_EN    (BIT(20))
#define EFUSE_SECURE_BOOT_EN_M  (EFUSE_SECURE_BOOT_EN_V << EFUSE_SECURE_BOOT_EN_S)
#define EFUSE_SECURE_BOOT_EN_V  0x00000001U
#define EFUSE_SECURE_BOOT_EN_S  20
/** EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE : RO; bitpos: [21]; default: 0;
 *  Set this bit to enable revoking aggressive secure boot.
 */
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE    (BIT(21))
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_M  (EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V << EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S)
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V  0x00000001U
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S  21
/** EFUSE_KM_DEPLOY_ONLY_ONCE_H : RO; bitpos: [22]; default: 0;
 *  EFUSE_KM_DEPLOY_ONLY_ONCE and EFUSE_KM_DEPLOY_ONLY_ONCE_H together form one field:
 *  {EFUSE_KM_DEPLOY_ONLY_ONCE_H, EFUSE_KM_DEPLOY_ONLY_ONCE[3:0]}. Set each bit to
 *  control whether corresponding key can only be deployed once. 1 is true, 0 is false.
 *  bit 0: ecsda, bit 1: xts, bit2: hmac, bit3: ds, bit4:psram
 */
#define EFUSE_KM_DEPLOY_ONLY_ONCE_H    (BIT(22))
#define EFUSE_KM_DEPLOY_ONLY_ONCE_H_M  (EFUSE_KM_DEPLOY_ONLY_ONCE_H_V << EFUSE_KM_DEPLOY_ONLY_ONCE_H_S)
#define EFUSE_KM_DEPLOY_ONLY_ONCE_H_V  0x00000001U
#define EFUSE_KM_DEPLOY_ONLY_ONCE_H_S  22
/** EFUSE_FORCE_USE_KEY_MANAGER_KEY_H : RO; bitpos: [23]; default: 0;
 *  EFUSE_FORCE_USE_KEY_MANAGER_KEY and EFUSE_FORCE_USE_KEY_MANAGER_KEY_H together form
 *  one field: {EFUSE_FORCE_USE_KEY_MANAGER_KEY_H,
 *  EFUSE_FORCE_USE_KEY_MANAGER_KEY[3:0]}. Set each bit to control whether
 *  corresponding key must come from key manager. 1 is true, 0 is false. bit 0: ecsda,
 *  bit 1: xts, bit2: hmac, bit3: ds, bit4:psram
 */
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_H    (BIT(23))
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_H_M  (EFUSE_FORCE_USE_KEY_MANAGER_KEY_H_V << EFUSE_FORCE_USE_KEY_MANAGER_KEY_H_S)
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_H_V  0x00000001U
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_H_S  23
/** EFUSE_RD_RESERVE_0_120 : RW; bitpos: [25:24]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_120    0x00000003U
#define EFUSE_RD_RESERVE_0_120_M  (EFUSE_RD_RESERVE_0_120_V << EFUSE_RD_RESERVE_0_120_S)
#define EFUSE_RD_RESERVE_0_120_V  0x00000003U
#define EFUSE_RD_RESERVE_0_120_S  24
/** EFUSE_FLASH_ECC_EN : RO; bitpos: [26]; default: 0;
 *  Set this bit to enable ECC for flash boot.
 */
#define EFUSE_FLASH_ECC_EN    (BIT(26))
#define EFUSE_FLASH_ECC_EN_M  (EFUSE_FLASH_ECC_EN_V << EFUSE_FLASH_ECC_EN_S)
#define EFUSE_FLASH_ECC_EN_V  0x00000001U
#define EFUSE_FLASH_ECC_EN_S  26
/** EFUSE_DIS_USB_OTG_DOWNLOAD_MODE : RO; bitpos: [27]; default: 0;
 *  Set this bit to disable download via USB-OTG.
 */
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE    (BIT(27))
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_M  (EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_V << EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_S)
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_USB_OTG_DOWNLOAD_MODE_S  27
/** EFUSE_FLASH_TPUW : RO; bitpos: [31:28]; default: 0;
 *  Configures flash waiting time after power-up, in unit of ms. When the value less
 *  than 15, the waiting time is the configurable value. Otherwise, the waiting time is
 *  30.
 */
#define EFUSE_FLASH_TPUW    0x0000000FU
#define EFUSE_FLASH_TPUW_M  (EFUSE_FLASH_TPUW_V << EFUSE_FLASH_TPUW_S)
#define EFUSE_FLASH_TPUW_V  0x0000000FU
#define EFUSE_FLASH_TPUW_S  28

/** EFUSE_RD_REPEAT_DATA3_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA3_REG (DR_REG_EFUSE_BASE + 0x3c)
/** EFUSE_DIS_DOWNLOAD_MODE : RO; bitpos: [0]; default: 0;
 *  Set this bit to disable download mode (boot_mode[3:0] = 0, 1, 2, 4, 5, 6, 7).
 */
#define EFUSE_DIS_DOWNLOAD_MODE    (BIT(0))
#define EFUSE_DIS_DOWNLOAD_MODE_M  (EFUSE_DIS_DOWNLOAD_MODE_V << EFUSE_DIS_DOWNLOAD_MODE_S)
#define EFUSE_DIS_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_MODE_S  0
/** EFUSE_DIS_DIRECT_BOOT : RO; bitpos: [1]; default: 0;
 *  Set this bit to disable direct boot mode
 */
#define EFUSE_DIS_DIRECT_BOOT    (BIT(1))
#define EFUSE_DIS_DIRECT_BOOT_M  (EFUSE_DIS_DIRECT_BOOT_V << EFUSE_DIS_DIRECT_BOOT_S)
#define EFUSE_DIS_DIRECT_BOOT_V  0x00000001U
#define EFUSE_DIS_DIRECT_BOOT_S  1
/** EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT : RO; bitpos: [2]; default: 0;
 *  Set this bit to disable USB-Serial-JTAG print during rom boot.
 */
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT    (BIT(2))
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_M  (EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_V << EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_S  2
/** EFUSE_LOCK_KM_KEY : RO; bitpos: [3]; default: 0;
 *  set this bit to lock the key manager key after deploy
 */
#define EFUSE_LOCK_KM_KEY    (BIT(3))
#define EFUSE_LOCK_KM_KEY_M  (EFUSE_LOCK_KM_KEY_V << EFUSE_LOCK_KM_KEY_S)
#define EFUSE_LOCK_KM_KEY_V  0x00000001U
#define EFUSE_LOCK_KM_KEY_S  3
/** EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE : RO; bitpos: [4]; default: 0;
 *  Set this bit to disable the USB-Serial-JTAG download function.
 */
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE    (BIT(4))
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_M  (EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_V << EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_S  4
/** EFUSE_ENABLE_SECURITY_DOWNLOAD : RO; bitpos: [5]; default: 0;
 *  Set this bit to enable security download mode.
 */
#define EFUSE_ENABLE_SECURITY_DOWNLOAD    (BIT(5))
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_M  (EFUSE_ENABLE_SECURITY_DOWNLOAD_V << EFUSE_ENABLE_SECURITY_DOWNLOAD_S)
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_V  0x00000001U
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_S  5
/** EFUSE_UART_PRINT_CONTROL : RO; bitpos: [7:6]; default: 0;
 *  Set the type of UART printing, 00: force enable printing, 01: enable printing when
 *  GPIO8 is reset at low level, 10: enable printing when GPIO8 is reset at high level,
 *  11: force disable printing
 */
#define EFUSE_UART_PRINT_CONTROL    0x00000003U
#define EFUSE_UART_PRINT_CONTROL_M  (EFUSE_UART_PRINT_CONTROL_V << EFUSE_UART_PRINT_CONTROL_S)
#define EFUSE_UART_PRINT_CONTROL_V  0x00000003U
#define EFUSE_UART_PRINT_CONTROL_S  6
/** EFUSE_FORCE_SEND_RESUME : RO; bitpos: [8]; default: 0;
 *  Set this bit to force ROM code to send a resume command during SPI boot.
 */
#define EFUSE_FORCE_SEND_RESUME    (BIT(8))
#define EFUSE_FORCE_SEND_RESUME_M  (EFUSE_FORCE_SEND_RESUME_V << EFUSE_FORCE_SEND_RESUME_S)
#define EFUSE_FORCE_SEND_RESUME_V  0x00000001U
#define EFUSE_FORCE_SEND_RESUME_S  8
/** EFUSE_SECURE_VERSION : RO; bitpos: [24:9]; default: 0;
 *  Secure version used by ESP-IDF anti-rollback feature.
 */
#define EFUSE_SECURE_VERSION    0x0000FFFFU
#define EFUSE_SECURE_VERSION_M  (EFUSE_SECURE_VERSION_V << EFUSE_SECURE_VERSION_S)
#define EFUSE_SECURE_VERSION_V  0x0000FFFFU
#define EFUSE_SECURE_VERSION_S  9
/** EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE : RO; bitpos: [25]; default: 0;
 *  Represents whether secure boot do fast verification on wake is disabled. 0: enabled
 *  1: disabled
 */
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE    (BIT(25))
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_M  (EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_V << EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_S)
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_V  0x00000001U
#define EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE_S  25
/** EFUSE_HYS_EN_PAD : RO; bitpos: [26]; default: 0;
 *  Set bits to enable hysteresis function of PAD0~27
 */
#define EFUSE_HYS_EN_PAD    (BIT(26))
#define EFUSE_HYS_EN_PAD_M  (EFUSE_HYS_EN_PAD_V << EFUSE_HYS_EN_PAD_S)
#define EFUSE_HYS_EN_PAD_V  0x00000001U
#define EFUSE_HYS_EN_PAD_S  26
/** EFUSE_KEY_PURPOSE_0_H : RO; bitpos: [27]; default: 0;
 *  Purpose of Key0. The 5-th bit.
 */
#define EFUSE_KEY_PURPOSE_0_H    (BIT(27))
#define EFUSE_KEY_PURPOSE_0_H_M  (EFUSE_KEY_PURPOSE_0_H_V << EFUSE_KEY_PURPOSE_0_H_S)
#define EFUSE_KEY_PURPOSE_0_H_V  0x00000001U
#define EFUSE_KEY_PURPOSE_0_H_S  27
/** EFUSE_KEY_PURPOSE_1_H : RO; bitpos: [28]; default: 0;
 *  Purpose of Key1. The 5-th bit.
 */
#define EFUSE_KEY_PURPOSE_1_H    (BIT(28))
#define EFUSE_KEY_PURPOSE_1_H_M  (EFUSE_KEY_PURPOSE_1_H_V << EFUSE_KEY_PURPOSE_1_H_S)
#define EFUSE_KEY_PURPOSE_1_H_V  0x00000001U
#define EFUSE_KEY_PURPOSE_1_H_S  28
/** EFUSE_KEY_PURPOSE_2_H : RO; bitpos: [29]; default: 0;
 *  Purpose of Key2. The 5-th bit.
 */
#define EFUSE_KEY_PURPOSE_2_H    (BIT(29))
#define EFUSE_KEY_PURPOSE_2_H_M  (EFUSE_KEY_PURPOSE_2_H_V << EFUSE_KEY_PURPOSE_2_H_S)
#define EFUSE_KEY_PURPOSE_2_H_V  0x00000001U
#define EFUSE_KEY_PURPOSE_2_H_S  29
/** EFUSE_KEY_PURPOSE_3_H : RO; bitpos: [30]; default: 0;
 *  Purpose of Key3. The 5-th bit.
 */
#define EFUSE_KEY_PURPOSE_3_H    (BIT(30))
#define EFUSE_KEY_PURPOSE_3_H_M  (EFUSE_KEY_PURPOSE_3_H_V << EFUSE_KEY_PURPOSE_3_H_S)
#define EFUSE_KEY_PURPOSE_3_H_V  0x00000001U
#define EFUSE_KEY_PURPOSE_3_H_S  30
/** EFUSE_KEY_PURPOSE_4_H : RO; bitpos: [31]; default: 0;
 *  Purpose of Key4. The 5-th bit.
 */
#define EFUSE_KEY_PURPOSE_4_H    (BIT(31))
#define EFUSE_KEY_PURPOSE_4_H_M  (EFUSE_KEY_PURPOSE_4_H_V << EFUSE_KEY_PURPOSE_4_H_S)
#define EFUSE_KEY_PURPOSE_4_H_V  0x00000001U
#define EFUSE_KEY_PURPOSE_4_H_S  31

/** EFUSE_RD_REPEAT_DATA4_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA4_REG (DR_REG_EFUSE_BASE + 0x40)
/** EFUSE_PXA0_TIEH_SEL_0 : RO; bitpos: [1:0]; default: 0;
 *  Output LDO VO0 tieh source select. 0: 1'b1 1: sdmmc1 2: reg 3:sdmmc0
 */
#define EFUSE_PXA0_TIEH_SEL_0    0x00000003U
#define EFUSE_PXA0_TIEH_SEL_0_M  (EFUSE_PXA0_TIEH_SEL_0_V << EFUSE_PXA0_TIEH_SEL_0_S)
#define EFUSE_PXA0_TIEH_SEL_0_V  0x00000003U
#define EFUSE_PXA0_TIEH_SEL_0_S  0
/** EFUSE_PVT_GLITCH_EN : RO; bitpos: [2]; default: 0;
 *  Represents whether to enable PVT power glitch monitor function.\\1:Enable.
 *  \\0:Disable
 */
#define EFUSE_PVT_GLITCH_EN    (BIT(2))
#define EFUSE_PVT_GLITCH_EN_M  (EFUSE_PVT_GLITCH_EN_V << EFUSE_PVT_GLITCH_EN_S)
#define EFUSE_PVT_GLITCH_EN_V  0x00000001U
#define EFUSE_PVT_GLITCH_EN_S  2
/** EFUSE_RD_RESERVE_0_163 : RW; bitpos: [3]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_163    (BIT(3))
#define EFUSE_RD_RESERVE_0_163_M  (EFUSE_RD_RESERVE_0_163_V << EFUSE_RD_RESERVE_0_163_S)
#define EFUSE_RD_RESERVE_0_163_V  0x00000001U
#define EFUSE_RD_RESERVE_0_163_S  3
/** EFUSE_KEY_PURPOSE_5_H : RO; bitpos: [4]; default: 0;
 *  Purpose of Key5. The 5-th bit.
 */
#define EFUSE_KEY_PURPOSE_5_H    (BIT(4))
#define EFUSE_KEY_PURPOSE_5_H_M  (EFUSE_KEY_PURPOSE_5_H_V << EFUSE_KEY_PURPOSE_5_H_S)
#define EFUSE_KEY_PURPOSE_5_H_V  0x00000001U
#define EFUSE_KEY_PURPOSE_5_H_S  4
/** EFUSE_RD_RESERVE_0_165 : RW; bitpos: [6:5]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_165    0x00000003U
#define EFUSE_RD_RESERVE_0_165_M  (EFUSE_RD_RESERVE_0_165_V << EFUSE_RD_RESERVE_0_165_S)
#define EFUSE_RD_RESERVE_0_165_V  0x00000003U
#define EFUSE_RD_RESERVE_0_165_S  5
/** EFUSE_KM_DISABLE_DEPLOY_MODE_H : RO; bitpos: [7]; default: 0;
 *  EFUSE_KM_DISABLE_DEPLOY_MODE and EFUSE_KM_DISABLE_DEPLOY_MODE_H together form one
 *  field: {EFUSE_KM_DISABLE_DEPLOY_MODE_H, EFUSE_KM_DISABLE_DEPLOY_MODE[3:0]}. Set
 *  each bit to control whether corresponding key's deploy mode of new value deployment
 *  is disabled. 1 is true, 0 is false. bit 0: ecsda, bit 1: xts, bit2: hmac, bit3: ds,
 *  bit4:psram
 */
#define EFUSE_KM_DISABLE_DEPLOY_MODE_H    (BIT(7))
#define EFUSE_KM_DISABLE_DEPLOY_MODE_H_M  (EFUSE_KM_DISABLE_DEPLOY_MODE_H_V << EFUSE_KM_DISABLE_DEPLOY_MODE_H_S)
#define EFUSE_KM_DISABLE_DEPLOY_MODE_H_V  0x00000001U
#define EFUSE_KM_DISABLE_DEPLOY_MODE_H_S  7
/** EFUSE_KM_DISABLE_DEPLOY_MODE : RO; bitpos: [11:8]; default: 0;
 *  EFUSE_KM_DISABLE_DEPLOY_MODE and EFUSE_KM_DISABLE_DEPLOY_MODE_H together form one
 *  field: {EFUSE_KM_DISABLE_DEPLOY_MODE_H, EFUSE_KM_DISABLE_DEPLOY_MODE[3:0]}. Set
 *  each bit to control whether corresponding key's deploy mode of new value deployment
 *  is disabled. 1 is true, 0 is false. bit 0: ecsda, bit 1: xts, bit2: hmac, bit3: ds,
 *  bit4:psram
 */
#define EFUSE_KM_DISABLE_DEPLOY_MODE    0x0000000FU
#define EFUSE_KM_DISABLE_DEPLOY_MODE_M  (EFUSE_KM_DISABLE_DEPLOY_MODE_V << EFUSE_KM_DISABLE_DEPLOY_MODE_S)
#define EFUSE_KM_DISABLE_DEPLOY_MODE_V  0x0000000FU
#define EFUSE_KM_DISABLE_DEPLOY_MODE_S  8
/** EFUSE_RD_RESERVE_0_172 : RW; bitpos: [15:12]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_172    0x0000000FU
#define EFUSE_RD_RESERVE_0_172_M  (EFUSE_RD_RESERVE_0_172_V << EFUSE_RD_RESERVE_0_172_S)
#define EFUSE_RD_RESERVE_0_172_V  0x0000000FU
#define EFUSE_RD_RESERVE_0_172_S  12
/** EFUSE_XTS_DPA_PSEUDO_LEVEL : RO; bitpos: [17:16]; default: 0;
 *  Sets this bit to control the xts pseudo-round anti-dpa attack function. 0:
 *  controlled by register. 1-3: the higher the value is, the more pseudo-rounds are
 *  inserted to the xts-aes calculation
 */
#define EFUSE_XTS_DPA_PSEUDO_LEVEL    0x00000003U
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_M  (EFUSE_XTS_DPA_PSEUDO_LEVEL_V << EFUSE_XTS_DPA_PSEUDO_LEVEL_S)
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_V  0x00000003U
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_S  16
/** EFUSE_HP_PWR_SRC_SEL : RO; bitpos: [18]; default: 0;
 *  HP system power source select. 0:LDO  1: DCDC
 */
#define EFUSE_HP_PWR_SRC_SEL    (BIT(18))
#define EFUSE_HP_PWR_SRC_SEL_M  (EFUSE_HP_PWR_SRC_SEL_V << EFUSE_HP_PWR_SRC_SEL_S)
#define EFUSE_HP_PWR_SRC_SEL_V  0x00000001U
#define EFUSE_HP_PWR_SRC_SEL_S  18
/** EFUSE_SECURE_BOOT_SHA384_EN : RO; bitpos: [19]; default: 0;
 *  Represents whether secure boot using SHA-384 is enabled. 0: disable 1: enable
 */
#define EFUSE_SECURE_BOOT_SHA384_EN    (BIT(19))
#define EFUSE_SECURE_BOOT_SHA384_EN_M  (EFUSE_SECURE_BOOT_SHA384_EN_V << EFUSE_SECURE_BOOT_SHA384_EN_S)
#define EFUSE_SECURE_BOOT_SHA384_EN_V  0x00000001U
#define EFUSE_SECURE_BOOT_SHA384_EN_S  19
/** EFUSE_DIS_WDT : RO; bitpos: [20]; default: 0;
 *  Set this bit to disable watch dog.
 */
#define EFUSE_DIS_WDT    (BIT(20))
#define EFUSE_DIS_WDT_M  (EFUSE_DIS_WDT_V << EFUSE_DIS_WDT_S)
#define EFUSE_DIS_WDT_V  0x00000001U
#define EFUSE_DIS_WDT_S  20
/** EFUSE_DIS_SWD : RO; bitpos: [21]; default: 0;
 *  Set bit to disable super-watchdog
 */
#define EFUSE_DIS_SWD    (BIT(21))
#define EFUSE_DIS_SWD_M  (EFUSE_DIS_SWD_V << EFUSE_DIS_SWD_S)
#define EFUSE_DIS_SWD_V  0x00000001U
#define EFUSE_DIS_SWD_S  21
/** EFUSE_PVT_GLITCH_MODE : RO; bitpos: [23:22]; default: 0;
 *  Use to configure glitch mode
 */
#define EFUSE_PVT_GLITCH_MODE    0x00000003U
#define EFUSE_PVT_GLITCH_MODE_M  (EFUSE_PVT_GLITCH_MODE_V << EFUSE_PVT_GLITCH_MODE_S)
#define EFUSE_PVT_GLITCH_MODE_V  0x00000003U
#define EFUSE_PVT_GLITCH_MODE_S  22
/** EFUSE_RD_RESERVE_0_184 : RW; bitpos: [31:24]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_184    0x000000FFU
#define EFUSE_RD_RESERVE_0_184_M  (EFUSE_RD_RESERVE_0_184_V << EFUSE_RD_RESERVE_0_184_S)
#define EFUSE_RD_RESERVE_0_184_V  0x000000FFU
#define EFUSE_RD_RESERVE_0_184_S  24

