espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/efuse_reg.h
/** EFUSE_RD_MAC_SYS_0_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS_0_REG (DR_REG_EFUSE_BASE + 0x44)
/** EFUSE_MAC_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents MAC address. Low 32-bit.
 */
#define EFUSE_MAC_0    0xFFFFFFFFU
#define EFUSE_MAC_0_M  (EFUSE_MAC_0_V << EFUSE_MAC_0_S)
#define EFUSE_MAC_0_V  0xFFFFFFFFU
#define EFUSE_MAC_0_S  0

/** EFUSE_RD_MAC_SYS_1_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS_1_REG (DR_REG_EFUSE_BASE + 0x48)
/** EFUSE_MAC_1 : RO; bitpos: [15:0]; default: 0;
 *  Represents MAC address. High 16-bit.
 */
#define EFUSE_MAC_1    0x0000FFFFU
#define EFUSE_MAC_1_M  (EFUSE_MAC_1_V << EFUSE_MAC_1_S)
#define EFUSE_MAC_1_V  0x0000FFFFU
#define EFUSE_MAC_1_S  0
/** EFUSE_RD_RESERVE_1_48 : RW; bitpos: [31:16]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_1_48    0x0000FFFFU
#define EFUSE_RD_RESERVE_1_48_M  (EFUSE_RD_RESERVE_1_48_V << EFUSE_RD_RESERVE_1_48_S)
#define EFUSE_RD_RESERVE_1_48_V  0x0000FFFFU
#define EFUSE_RD_RESERVE_1_48_S  16

/** EFUSE_RD_MAC_SYS_2_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS_2_REG (DR_REG_EFUSE_BASE + 0x4c)
/** EFUSE_WAFER_VERSION_MINOR : R; bitpos: [3:0]; default: 0;
 *  Minor chip version
 */
#define EFUSE_WAFER_VERSION_MINOR    0x0000000FU
#define EFUSE_WAFER_VERSION_MINOR_M  (EFUSE_WAFER_VERSION_MINOR_V << EFUSE_WAFER_VERSION_MINOR_S)
#define EFUSE_WAFER_VERSION_MINOR_V  0x0000000FU
#define EFUSE_WAFER_VERSION_MINOR_S  0
/** EFUSE_WAFER_VERSION_MAJOR_LO : R; bitpos: [5:4]; default: 0;
 *  Major chip version (lower 2 bits)
 */
#define EFUSE_WAFER_VERSION_MAJOR_LO    0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_LO_M  (EFUSE_WAFER_VERSION_MAJOR_LO_V << EFUSE_WAFER_VERSION_MAJOR_LO_S)
#define EFUSE_WAFER_VERSION_MAJOR_LO_V  0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_LO_S  4
/** EFUSE_DISABLE_WAFER_VERSION_MAJOR : R; bitpos: [6]; default: 0;
 *  Disables check of wafer version major
 */
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR    (BIT(6))
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR_M  (EFUSE_DISABLE_WAFER_VERSION_MAJOR_V << EFUSE_DISABLE_WAFER_VERSION_MAJOR_S)
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR_V  0x00000001U
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR_S  6
/** EFUSE_DISABLE_BLK_VERSION_MAJOR : R; bitpos: [7]; default: 0;
 *  Disables check of blk version major
 */
#define EFUSE_DISABLE_BLK_VERSION_MAJOR    (BIT(7))
#define EFUSE_DISABLE_BLK_VERSION_MAJOR_M  (EFUSE_DISABLE_BLK_VERSION_MAJOR_V << EFUSE_DISABLE_BLK_VERSION_MAJOR_S)
#define EFUSE_DISABLE_BLK_VERSION_MAJOR_V  0x00000001U
#define EFUSE_DISABLE_BLK_VERSION_MAJOR_S  7
/** EFUSE_BLK_VERSION_MINOR : R; bitpos: [10:8]; default: 0;
 *  BLK_VERSION_MINOR of BLOCK2
 */
#define EFUSE_BLK_VERSION_MINOR    0x00000007U
#define EFUSE_BLK_VERSION_MINOR_M  (EFUSE_BLK_VERSION_MINOR_V << EFUSE_BLK_VERSION_MINOR_S)
#define EFUSE_BLK_VERSION_MINOR_V  0x00000007U
#define EFUSE_BLK_VERSION_MINOR_S  8
/** EFUSE_BLK_VERSION_MAJOR : R; bitpos: [12:11]; default: 0;
 *  BLK_VERSION_MAJOR of BLOCK2
 */
#define EFUSE_BLK_VERSION_MAJOR    0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_M  (EFUSE_BLK_VERSION_MAJOR_V << EFUSE_BLK_VERSION_MAJOR_S)
#define EFUSE_BLK_VERSION_MAJOR_V  0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_S  11
/** EFUSE_PSRAM_CAP : R; bitpos: [15:13]; default: 0;
 *  PSRAM capacity
 */
#define EFUSE_PSRAM_CAP    0x00000007U
#define EFUSE_PSRAM_CAP_M  (EFUSE_PSRAM_CAP_V << EFUSE_PSRAM_CAP_S)
#define EFUSE_PSRAM_CAP_V  0x00000007U
#define EFUSE_PSRAM_CAP_S  13
/** EFUSE_TEMP : R; bitpos: [17:16]; default: 0;
 *  Operating temperature of the ESP chip
 */
#define EFUSE_TEMP    0x00000003U
#define EFUSE_TEMP_M  (EFUSE_TEMP_V << EFUSE_TEMP_S)
#define EFUSE_TEMP_V  0x00000003U
#define EFUSE_TEMP_S  16
/** EFUSE_PSRAM_VENDOR : R; bitpos: [19:18]; default: 0;
 *  PSRAM vendor
 */
#define EFUSE_PSRAM_VENDOR    0x00000003U
#define EFUSE_PSRAM_VENDOR_M  (EFUSE_PSRAM_VENDOR_V << EFUSE_PSRAM_VENDOR_S)
#define EFUSE_PSRAM_VENDOR_V  0x00000003U
#define EFUSE_PSRAM_VENDOR_S  18
/** EFUSE_PKG_VERSION : R; bitpos: [22:20]; default: 0;
 *  Package version
 */
#define EFUSE_PKG_VERSION    0x00000007U
#define EFUSE_PKG_VERSION_M  (EFUSE_PKG_VERSION_V << EFUSE_PKG_VERSION_S)
#define EFUSE_PKG_VERSION_V  0x00000007U
#define EFUSE_PKG_VERSION_S  20
/** EFUSE_WAFER_VERSION_MAJOR_HI : R; bitpos: [23]; default: 0;
 *  Major chip version (MSB)
 */
#define EFUSE_WAFER_VERSION_MAJOR_HI    (BIT(23))
#define EFUSE_WAFER_VERSION_MAJOR_HI_M  (EFUSE_WAFER_VERSION_MAJOR_HI_V << EFUSE_WAFER_VERSION_MAJOR_HI_S)
#define EFUSE_WAFER_VERSION_MAJOR_HI_V  0x00000001U
#define EFUSE_WAFER_VERSION_MAJOR_HI_S  23
/** EFUSE_LDO_VO1_DREF : R; bitpos: [27:24]; default: 0;
 *  Output VO1 parameter
 */
#define EFUSE_LDO_VO1_DREF    0x0000000FU
#define EFUSE_LDO_VO1_DREF_M  (EFUSE_LDO_VO1_DREF_V << EFUSE_LDO_VO1_DREF_S)
#define EFUSE_LDO_VO1_DREF_V  0x0000000FU
#define EFUSE_LDO_VO1_DREF_S  24
/** EFUSE_LDO_VO2_DREF : R; bitpos: [31:28]; default: 0;
 *  Output VO2 parameter
 */
#define EFUSE_LDO_VO2_DREF    0x0000000FU
#define EFUSE_LDO_VO2_DREF_M  (EFUSE_LDO_VO2_DREF_V << EFUSE_LDO_VO2_DREF_S)
#define EFUSE_LDO_VO2_DREF_V  0x0000000FU
#define EFUSE_LDO_VO2_DREF_S  28

/** EFUSE_RD_MAC_SYS_3_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS_3_REG (DR_REG_EFUSE_BASE + 0x50)
/** EFUSE_LDO_VO1_MUL : R; bitpos: [2:0]; default: 0;
 *  Output VO1 parameter
 */
#define EFUSE_LDO_VO1_MUL    0x00000007U
#define EFUSE_LDO_VO1_MUL_M  (EFUSE_LDO_VO1_MUL_V << EFUSE_LDO_VO1_MUL_S)
#define EFUSE_LDO_VO1_MUL_V  0x00000007U
#define EFUSE_LDO_VO1_MUL_S  0
/** EFUSE_LDO_VO2_MUL : R; bitpos: [5:3]; default: 0;
 *  Output VO2 parameter
 */
#define EFUSE_LDO_VO2_MUL    0x00000007U
#define EFUSE_LDO_VO2_MUL_M  (EFUSE_LDO_VO2_MUL_V << EFUSE_LDO_VO2_MUL_S)
#define EFUSE_LDO_VO2_MUL_V  0x00000007U
#define EFUSE_LDO_VO2_MUL_S  3
/** EFUSE_LDO_VO3_K : R; bitpos: [13:6]; default: 0;
 *  Output VO3 calibration parameter
 */
#define EFUSE_LDO_VO3_K    0x000000FFU
#define EFUSE_LDO_VO3_K_M  (EFUSE_LDO_VO3_K_V << EFUSE_LDO_VO3_K_S)
#define EFUSE_LDO_VO3_K_V  0x000000FFU
#define EFUSE_LDO_VO3_K_S  6
/** EFUSE_LDO_VO3_VOS : R; bitpos: [19:14]; default: 0;
 *  Output VO3 calibration parameter
 */
#define EFUSE_LDO_VO3_VOS    0x0000003FU
#define EFUSE_LDO_VO3_VOS_M  (EFUSE_LDO_VO3_VOS_V << EFUSE_LDO_VO3_VOS_S)
#define EFUSE_LDO_VO3_VOS_V  0x0000003FU
#define EFUSE_LDO_VO3_VOS_S  14
/** EFUSE_LDO_VO3_C : R; bitpos: [25:20]; default: 0;
 *  Output VO3 calibration parameter
 */
#define EFUSE_LDO_VO3_C    0x0000003FU
#define EFUSE_LDO_VO3_C_M  (EFUSE_LDO_VO3_C_V << EFUSE_LDO_VO3_C_S)
#define EFUSE_LDO_VO3_C_V  0x0000003FU
#define EFUSE_LDO_VO3_C_S  20
/** EFUSE_LDO_VO4_K : R; bitpos: [31:26]; default: 0;
 *  Output VO4 calibration parameter
 */
#define EFUSE_LDO_VO4_K    0x0000003FU
#define EFUSE_LDO_VO4_K_M  (EFUSE_LDO_VO4_K_V << EFUSE_LDO_VO4_K_S)
#define EFUSE_LDO_VO4_K_V  0x0000003FU
#define EFUSE_LDO_VO4_K_S  26

/** EFUSE_RD_MAC_SYS_4_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS_4_REG (DR_REG_EFUSE_BASE + 0x54)
/** EFUSE_LDO_VO4_K_1 : R; bitpos: [1:0]; default: 0;
 *  Output VO4 calibration parameter
 */
#define EFUSE_LDO_VO4_K_1    0x00000003U
#define EFUSE_LDO_VO4_K_1_M  (EFUSE_LDO_VO4_K_1_V << EFUSE_LDO_VO4_K_1_S)
#define EFUSE_LDO_VO4_K_1_V  0x00000003U
#define EFUSE_LDO_VO4_K_1_S  0
/** EFUSE_LDO_VO4_VOS : R; bitpos: [7:2]; default: 0;
 *  Output VO4 calibration parameter
 */
#define EFUSE_LDO_VO4_VOS    0x0000003FU
#define EFUSE_LDO_VO4_VOS_M  (EFUSE_LDO_VO4_VOS_V << EFUSE_LDO_VO4_VOS_S)
#define EFUSE_LDO_VO4_VOS_V  0x0000003FU
#define EFUSE_LDO_VO4_VOS_S  2
/** EFUSE_LDO_VO4_C : R; bitpos: [13:8]; default: 0;
 *  Output VO4 calibration parameter
 */
#define EFUSE_LDO_VO4_C    0x0000003FU
#define EFUSE_LDO_VO4_C_M  (EFUSE_LDO_VO4_C_V << EFUSE_LDO_VO4_C_S)
#define EFUSE_LDO_VO4_C_V  0x0000003FU
#define EFUSE_LDO_VO4_C_S  8
/** EFUSE_RESERVED_1_142 : R; bitpos: [15:14]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_142    0x00000003U
#define EFUSE_RESERVED_1_142_M  (EFUSE_RESERVED_1_142_V << EFUSE_RESERVED_1_142_S)
#define EFUSE_RESERVED_1_142_V  0x00000003U
#define EFUSE_RESERVED_1_142_S  14
/** EFUSE_ACTIVE_HP_DBIAS : R; bitpos: [19:16]; default: 0;
 *  Active HP DBIAS of fixed voltage
 */
#define EFUSE_ACTIVE_HP_DBIAS    0x0000000FU
#define EFUSE_ACTIVE_HP_DBIAS_M  (EFUSE_ACTIVE_HP_DBIAS_V << EFUSE_ACTIVE_HP_DBIAS_S)
#define EFUSE_ACTIVE_HP_DBIAS_V  0x0000000FU
#define EFUSE_ACTIVE_HP_DBIAS_S  16
/** EFUSE_ACTIVE_LP_DBIAS : R; bitpos: [23:20]; default: 0;
 *  Active LP DBIAS of fixed voltage
 */
#define EFUSE_ACTIVE_LP_DBIAS    0x0000000FU
#define EFUSE_ACTIVE_LP_DBIAS_M  (EFUSE_ACTIVE_LP_DBIAS_V << EFUSE_ACTIVE_LP_DBIAS_S)
#define EFUSE_ACTIVE_LP_DBIAS_V  0x0000000FU
#define EFUSE_ACTIVE_LP_DBIAS_S  20
/** EFUSE_RESERVED_1_152 : R; bitpos: [27:24]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_152    0x0000000FU
#define EFUSE_RESERVED_1_152_M  (EFUSE_RESERVED_1_152_V << EFUSE_RESERVED_1_152_S)
#define EFUSE_RESERVED_1_152_V  0x0000000FU
#define EFUSE_RESERVED_1_152_S  24
/** EFUSE_DSLP_DBG : R; bitpos: [31:28]; default: 0;
 *  DSLP BDG of fixed voltage
 */
#define EFUSE_DSLP_DBG    0x0000000FU
#define EFUSE_DSLP_DBG_M  (EFUSE_DSLP_DBG_V << EFUSE_DSLP_DBG_S)
#define EFUSE_DSLP_DBG_V  0x0000000FU
#define EFUSE_DSLP_DBG_S  28

/** EFUSE_RD_MAC_SYS_5_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS_5_REG (DR_REG_EFUSE_BASE + 0x58)
/** EFUSE_DSLP_LP_DBIAS : R; bitpos: [4:0]; default: 0;
 *  DSLP LP DBIAS of fixed voltage
 */
#define EFUSE_DSLP_LP_DBIAS    0x0000001FU
#define EFUSE_DSLP_LP_DBIAS_M  (EFUSE_DSLP_LP_DBIAS_V << EFUSE_DSLP_LP_DBIAS_S)
#define EFUSE_DSLP_LP_DBIAS_V  0x0000001FU
#define EFUSE_DSLP_LP_DBIAS_S  0
/** EFUSE_LP_DCDC_DBIAS_VOL_GAP : R; bitpos: [9:5]; default: 0;
 *  DBIAS gap between LP and DCDC
 */
#define EFUSE_LP_DCDC_DBIAS_VOL_GAP    0x0000001FU
#define EFUSE_LP_DCDC_DBIAS_VOL_GAP_M  (EFUSE_LP_DCDC_DBIAS_VOL_GAP_V << EFUSE_LP_DCDC_DBIAS_VOL_GAP_S)
#define EFUSE_LP_DCDC_DBIAS_VOL_GAP_V  0x0000001FU
#define EFUSE_LP_DCDC_DBIAS_VOL_GAP_S  5
/** EFUSE_RESERVED_1_170 : R; bitpos: [10]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_170    (BIT(10))
#define EFUSE_RESERVED_1_170_M  (EFUSE_RESERVED_1_170_V << EFUSE_RESERVED_1_170_S)
#define EFUSE_RESERVED_1_170_V  0x00000001U
#define EFUSE_RESERVED_1_170_S  10
/** EFUSE_PVT_400M_BIAS : R; bitpos: [15:11]; default: 0;
 *  PVT_DCM_VSET when the CPU is at 400M
 */
#define EFUSE_PVT_400M_BIAS    0x0000001FU
#define EFUSE_PVT_400M_BIAS_M  (EFUSE_PVT_400M_BIAS_V << EFUSE_PVT_400M_BIAS_S)
#define EFUSE_PVT_400M_BIAS_V  0x0000001FU
#define EFUSE_PVT_400M_BIAS_S  11
/** EFUSE_PVT_40M_BIAS : R; bitpos: [20:16]; default: 0;
 *  PVT_DCM_VSET corresponding to about 0.9V fixed voltage when the CPU is at 40M
 */
#define EFUSE_PVT_40M_BIAS    0x0000001FU
#define EFUSE_PVT_40M_BIAS_M  (EFUSE_PVT_40M_BIAS_V << EFUSE_PVT_40M_BIAS_S)
#define EFUSE_PVT_40M_BIAS_V  0x0000001FU
#define EFUSE_PVT_40M_BIAS_S  16
/** EFUSE_PVT_100M_BIAS : R; bitpos: [25:21]; default: 0;
 *  PVT_DCM_VSET corresponding to about 1.0V fixed voltage when the CPU is at 100M
 */
#define EFUSE_PVT_100M_BIAS    0x0000001FU
#define EFUSE_PVT_100M_BIAS_M  (EFUSE_PVT_100M_BIAS_V << EFUSE_PVT_100M_BIAS_S)
#define EFUSE_PVT_100M_BIAS_V  0x0000001FU
#define EFUSE_PVT_100M_BIAS_S  21
/** EFUSE_RESERVED_1_186 : R; bitpos: [31:26]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_186    0x0000003FU
#define EFUSE_RESERVED_1_186_M  (EFUSE_RESERVED_1_186_V << EFUSE_RESERVED_1_186_S)
#define EFUSE_RESERVED_1_186_V  0x0000003FU
#define EFUSE_RESERVED_1_186_S  26

/** EFUSE_RD_SYS_PART1_DATA0_REG register
 *  Represents rd_sys_part1_data0
 */
#define EFUSE_RD_SYS_PART1_DATA0_REG (DR_REG_EFUSE_BASE + 0x5c)
/** EFUSE_OPTIONAL_UNIQUE_ID : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_M  (EFUSE_OPTIONAL_UNIQUE_ID_V << EFUSE_OPTIONAL_UNIQUE_ID_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_S  0

/** EFUSE_RD_SYS_PART1_DATA1_REG register
 *  Represents rd_sys_part1_data1
 */
#define EFUSE_RD_SYS_PART1_DATA1_REG (DR_REG_EFUSE_BASE + 0x60)
/** EFUSE_OPTIONAL_UNIQUE_ID_1 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_1    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_M  (EFUSE_OPTIONAL_UNIQUE_ID_1_V << EFUSE_OPTIONAL_UNIQUE_ID_1_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_1_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_S  0

/** EFUSE_RD_SYS_PART1_DATA2_REG register
 *  Represents rd_sys_part1_data2
 */
#define EFUSE_RD_SYS_PART1_DATA2_REG (DR_REG_EFUSE_BASE + 0x64)
/** EFUSE_OPTIONAL_UNIQUE_ID_2 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_2    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_M  (EFUSE_OPTIONAL_UNIQUE_ID_2_V << EFUSE_OPTIONAL_UNIQUE_ID_2_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_2_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_S  0

